[
    {
        "title": "Why Study Abroad? Stories From International Students",
        "image": "https://leverageedublog.s3.ap-south-1.amazonaws.com/blog/wp-content/uploads/2020/03/24185445/how-to-study-abroad.jpg",
        "category": "studyAbroad",
        "blogPostedTime": "1:29 PM 10-7-2023",
        "description": "You might find a degree course that isn’t available in your home country; you might learn to live independently; or you might network with amazing people and learn about other cultures. Whatever your reason for considering the experience, there are so many more positives. And if you don’t believe us, just look at what real students had to say about studying abroad. The American university experience is unlike any other in the world and certainly very distinct from my home country, India. I was particularly drawn to the academic possibilities. As an undergraduate, you can study a range of subjects, and most universities don’t require you to declare your major until your junior year, giving you time to explore a variety of academic paths and see what interests you. Some universities, including my own, require undergraduates to take a core curriculum of classes, developing the basics. Your course can be customisable, allowing you to choose multiple majors and minors, change things as you go along, and take electives that are unrelated to your main areas of study. I really benefited from this diverse way of learning. I entered university committed to studying politics, but my discovery of college-level English literature classes was transformative and reoriented my interests in a way that could never have happened without the freedom that the US system encourages and celebrates. Moving to Dublin for my university education in 2020 came with so much excitement and a little bit of nerves. Nevertheless, I stayed optimistic about starting something that was once a dream – studying medicine. Studying abroad meant learning to live independently, which has allowed me to grow as an individual, overcome everyday challenges and build life skills such as managing my finances. Studying abroad has also given me the opportunity to experience a style of education different from that in my home country, Nigeria. By exploring the environment around me, travelling, taking up volunteer work and through learning in the classroom, I am beginning to see the world and gain new perspectives. During my time in Ireland so far, I have also been able to develop long-lasting friendships and create beautiful memories with people from diverse backgrounds and countries including Trinidad and Tobago, Malaysia, Canada, Iraq and many more. Finally, I have discovered new interests and found new hobbies including kick-boxing, something I might not have discovered if I stayed back in my home country. Studying abroad has been a life-changing experience so far. One of the benefits of studying abroad is learning more about yourself outside your comfort zone. At first, you might struggle, feel homesick and even question whether you made the right choice. However, as time passes, you learn more about yourself and how to cope with problems on your own. The things that have made you feel anxious before, like having your final exam, later seem like minor problems that you can handle. Eventually, you feel less scared and will learn independence. My experience when I first came to Canada from my home in Turkey was like being a swimmer without a lifeline in the ocean. Eventually, I learned how to surf the waves and enjoyed new ones as they came. In the end, studying abroad has benefited me beyond the academics; I also found myself."
    },

    {
        "title": "How to Prepare for Studying Abroad: Financial Journey",
        "image": "https://images.yourstory.com/cs/2/220356402d6d11e9aa979329348d4c3e/educationloan-1623077366527.jpg",
        "category": "studyAbroad",
        "blogPostedTime": "5:10 PM 03-6-2023",
        "description": "Liliana Rivera, a US student from Austin, Texas, shares her advice to help other US students find funding and prepare financially to study in another country. When I first became interested in study-abroad programmes, one of my biggest concerns was funding. After my first semester at the University of Texas at Austin, I had heard so many stories from my Korean professor about her students who had studied abroad. Before attending college, going abroad had not been a goal for me. But as I studied a double major in Asian Studies and Asian Cultures and Languages, with a focus on Korea, I knew that studying abroad would help me become more immersed in my studies. After completing all the applications, I began to prepare myself financially, in case I was unable to get enough financial aid. I remember being disappointed when I got three scholarship rejection emails back to back, but I didn’t give up. I began saving all the money I could. I learned how to crochet so I could make some money on the side. I also tried to take into consideration the popularity of the area and the university that I wanted to study at since these processes can be quite competitive and require some prerequisites. For example, my target university, Seoul National University, needed a minimum of 3.0 grade point average (GPA) and one year of college-level Korean. The most effective way to approach finding multiple forms of funding is to organise application deadlines and start applying as soon as possible. Most scholarship applications have deadlines that are due at the same time (or even sooner) than the university application deadlines. I found this out the hard way, so I had lots of cramming and emails to write. Write down all the deadline dates and keep checking them to make sure you don’t have to cram all your application writing into one week. Be sure to give yourself time to write your essays, too. Many scholarships will ask for your motivations for studying abroad and why the chosen location will help you with your studies, so prepare to write answers to these questions multiple times. Another part of your application to prepare is your recommendation letters. Be sure to reach out to your professors with plenty of time to complete them."
    },

    {
        "title": "Experiences of Studying in Asia, North America and Oceania",
        "image": "https://myaccount.edunews.com/contents/news/8598175.77926357-254685.022723789.jpg",
        "category": "studyAbroad",
        "blogPostedTime": "9:19 AM 19-7-2023",
        "description": "Elisha Rehan grew up in Malaysia and dreamed of pursuing an environment-related career. Here she explains what it was like to study her undergraduate degree in the US and how it led her to her postgraduate studies in Australia. Growing up in Malaysia in a household of six people made overseas vacations for our family rare. My ayah (father) and grandparents would continuously remind us that education opens more doors for us to explore the world. They were correct. At 21 years old, I have been lucky enough to have lived in several countries, including the US and South Korea, because of my education journey. Now, I am pursuing my postgraduate degree in Australia. I am forever grateful to the Malaysian government agency, Majlis Amanah Rakyat (MARA), for trusting in my passion and abilities to sponsor me for my overseas degrees. I always wanted to study a degree focusing on the environment as it has been my passion since high school. When MARA offered me a scholarship to pursue environmental engineering in the US, I jumped into it as fast as I could. Students from all over Malaysia were given six months of intense maths and English classes to prepare us for both the SAT and TOEFL exams in June before we even applied for universities. MARA provided lecturers and student officers who helped us apply to universities and community colleges around the US in July. I was accepted into one of these community colleges in California. Once I had my offer letter, I applied for a US F-1 visa (student visa) online and booked an in-person interview at the US Embassy. My visa was granted in August. This was sooner than the normal timeline, probably because I was under a Malaysian government sponsorship. Typically, they can take up to several weeks to be approved. I arrived in California on 31 August with several other Malaysian students to start our college careers at Ohlone College, a community college in Fremont. I then took all my prerequisite courses to transfer to a bigger university for my bachelor’s degree. Classrooms in a community college are much smaller, with most classes having 15 to 25 students maximum per class. This was a good opportunity to participate more in class and it was easier to network with professors and classmates."
    },

    {
        "title": "Scholarships For Abroad Study",
        "image": "https://www.wemakescholars.com/uploads/blog/tips-to-maximize-your-chance-of-winning-an-International-Scholarship.webp",
        "category": "visaScholarship",
        "blogPostedTime": "9:17 PM 26-7-2023",
        "description": "Studying abroad is a fantastic way to continue along your path of pursuing higher education while also having the opportunity to experience the life and culture of another country. However, it’s no secret that studying abroad can be a costly endeavor, when you add up tuition and fees, room and board, and other costs that often come with exploring somewhere new. So, in this post, we highlight some great study abroad scholarships to help you fund your travels! With a wide range of universities, diverse academic programs, top-notch faculty, and a chance to gain international exposure, pursuing overseas education can be fruitful. However, managing the tuition fees and living expenses can be challenging for some. In such scenarios, an abroad education scholarship can be a great source of help! Read this comprehensive blog on study abroad scholarships which you can consider to pursue higher education! It provides you with a comprehensive list of scholarships for higher studies abroad for students. You must have come across a dozen of study abroad scholarships that cover the entire expense of tuition fees and are fully funded. But have you heard about the popular Leverage Edu scholarship worth INR 7,00,00,000! Yes, you read it right, Leverage Edu is offering an overseas scholarship worth INR 7 Crore exclusively for Indian students. India’s largest study abroad scholarship is meant to help hundreds of Indians with waivers on their tuition fees, living expenses, as well as easing costs related to visa applications, excursions, and on-campus expenditure. Benjamin Gilman International Scholarship Program is one of the popular and prestigious scholarships for overseas education. Funded by the US Government and Implemented by the Institute of International Education, it is offered to undergraduate students who are Federal Pell Grant holders and are citizens of the USA. For the year 2020, close to 5,000 USD(INR 4.14 lacs) will be disbursed to prospective candidates who wish to study or intern in an array of countries abroad. Cultural Experiences Abroad or CEA offers a wide range of merit/need-based, faculty-led programs, affiliates, and more such scholarship abroad for students coming from diverse backgrounds. To make education accessible to all, the scholarship amounts offered by CEA range between $400 – $2000(INR 33K- 1.65 lacs). Parameters like personal essays, letters of recommendation, and GPA are considered to award scholarships to prospective candidates. Offered to those who have been granted admission to undergraduate or postgraduate programs of Newcastle University, the Vice-Chancellor’s International Scholarship is one of the most popular studies abroad scholarships for Indian students. A partial aid of £3,000 (INR 2.80 lacs) covering 1-year tuition fees is provided to the prospective candidates. The Institute for the International Education of Students or IES abroad is another entrant to our list of study abroad scholarships. To make your entire educational journey and experience quite affordable, the group offers scholarships in major subjects including, Art & History, Business, Economics, Engineering, Finance, Geography, STEM courses, Urban Studies, etc covering universities of various countries. The scholarships are available round the year and the deadline varies If you want to pursue a career in Research, then this fellowship is what you can aim for. It is awarded to only women candidates who hold a bachelor’s degree and are non-US residents/citizens. Ranging from $18,000–$30,000 (INR 14.93 lacs- 24.88 lacs) (based on the level of education), it is a golden opportunity for those who want to expand their careers in the field of Business, Arts, or Scientific fields."
    },

    {
        "title": "Study Scholarships in Canada",
        "image": "https://wallpaperaccess.com/full/5252844.png",
        "category": "visaScholarship",
        "blogPostedTime": "11:56 AM 21-6-2023",
        "description": "Study in Canada Scholarships aim to increase opportunities for Canadian post-secondary institutions to welcome international students from a wide range of countries and territories on short-term exchanges for study or research. This will provide institutions the opportunity to strengthen and diversify their international linkages and promote their academic and research excellence in new markets. The new connections created through the program will diversify and enrich Canada’s education engagement with a diverse range of partners, strengthen bilateral ties, and complement the Government of Canada’s broader international trade diversification efforts. The Study in Canada Scholarships is a Short-term Exchange Program under Global Affairs Canada’s International Scholarships Program. To be eligible, you must be: a citizen of an eligible country/territory. Like ==> Asia: Bangladesh, Nepal, Taiwan. ==> Europe: Türkiye, Ukraine. ==> Middle East and North Africa: Algeria, Egypt, Jordan, Morocco, Tunisia. ==> Sub-Saharan Africa: Burkina Faso, Ethiopia, Ghana, Ivory Coast, Kenya, Nigeria, Rwanda, Senegal, Tanzania, Uganda You are not eligible for this scholarship if you hold or have a pending application for Canadian citizenship or permanent residency or you are already participating in a scholarship program funded by the Government of Canada or you are already enrolled in a degree, diploma or certificate program at a Canadian post-secondary institution"
    },

    {
        "title": "Everything You Need to Know about International Student Visa",
        "image": "https://assets-us-01.kc-usercontent.com/95d47d95-36b6-00af-a24c-b886ecdfc4a2/4dfd6808-1f03-4d07-b780-8b5831125d4b/51315.jpg",
        "category": "visaScholarship",
        "blogPostedTime": "10:57 AM 24-6-2023",
        "description": "Say you dream of taking some time off after you finish high school to travel the world, meet new people and decide on your Bachelor’s specialization. Universities usually like students with some life experience, especially if they are able to show how a gap year has expanded their perspectives.But, besides polishing your CV, a gap year can be used to check out the country or city where you want to study – see how it suits you. And since you’re there, why not take some Pre-Bachelor’s courses? Pre-Bachelors are usually short and medium-term courses (2 months to a year) which help you prepare for your Bachelor’s admission. They will increase your chances of getting in a university, while at the same time give you the opportunity to start networking with teachers and other students. Sometimes, a gap-year is a result of circumstances. Maybe your saving money for a Bachelor’s abroad, maybe you started a family earlier, or you have some other personal issues that prevent you from travelling immediately after high school. If you are in such a situation, you can still make the best out of a ‘forced’ gap year by pursuing an online Pre-Bachelor’s. It gives you flexibility and helps you keep contact with the academic world, so that when you are ready for a full-time Bachelor’s you are not completely disconnected from the student environment. If you’re the ambitious type of student who can’t imagine going to any other university than his top pick, you’ll be glad to know you are not alone. Many prospective Bachelor’s students choose to invest a year in a complex Pre-Bachelor’s programme that will give them a competitive advantage when applying for a Bachelor’s. While this is more a preparatory year than a gap year, you can still make the best of it, because the curricula is more relaxed than during Bachelor’s studies. Opinions on gap years vary from person to person. Some say they are important to get practical life experiences and develop as an adult before doing Bachelor’s studies. Others prefer doing their Bachelor’s straightway because they want to graduate faster. In the end, it’s a matter of personal goals and ambitions, which are unique for every individual. If you think a gap year can help you grow, see the world and better prepare you for your future studies, go for it and don’t let anyone tell you otherwise!"
    },

    {
        "title": "Four Reasons Why Year Gap Before Bachelor's Isn't End of life",
        "image": "https://www.marketing91.com/wp-content/uploads/2020/07/Research-Gap.jpg",
        "category": "studyProgram",
        "blogPostedTime": "8:45 PM 11-7-2023",
        "description": "If you are on a journey abroad for the pursuit of further education, you will be facing several stops before you reach the final destination. Standardised entrance tests, language proficiency tests, educational and financial documents and the penultimate stop on this journey is your student visa process. If you are someone who is unaware of the nitigities of applying for a student visa, you've landed at the right place! This blog will make you acquainted with a student visa guide with the minutest details of student visa including information on student visa USA requirements, age limit, cost, and how to get study visa! A visa is essentially a document which allows a person to stay in another country for a specified amount of time. A student visa, thus, is a document permitting a student to stay in another country for educational purposes. At times, the visa also permits the student to stay for some months or years after the education, depending upon various factors. Primarily, you will need a valid passport. Now, the requirement of its validity would differ from country to country. Some countries require a passport which must be valid even till the end of your course while some do not have that requirement. Furthermore, if you are a travel enthusiast, ensure that your passport has at least two blank pages left for the visa. The rules are as candid as they are important. Indeed, you want to fit in at the university as well as in the country you are going to, right? Thus, you will essentially need to prove that you are proficient in their native language. If you are planning to head to an English-speaking country, then the most commonly accepted language proficiency tests are TOEFL, IELTS and/or PTE. If, however, your pursuit leads you to a country with a different native language, you will need to certify yourself in it. For instance, if you wish to go to Germany for your education, you must be certified with their CEFR Certified Levels. Before you register for a language proficiency test, make sure you check their validity in the country you are going to. A plethora of European universities do not accept TOEFL scores for language proficiency tests. Last, but definitely not the least. Most countries ask for proof that you are financially capable to study in the country as well as manage your living expenses. Some countries provide a specific number for the living expenses while some provide ambiguous guidelines. Alright, then. A question that has definitely popped in your mind: When to apply for a study abroad visa? Should you apply right away after receiving the admit? Maybe. Maybe not. There is a limit on how early you can apply for an international student visa. For instance, if you are applying for an F-1 student visa to study in the US, you can apply no earlier than 120 days from the start of your classes. You can get the information from the embassy websites of the country you are targeting. Moreover, you will also find the application forms, required documentation and regulations concerning the student visa process. The visa interview questions and their corresponding answers are critically important and they decide the fate of your visa results. The questions are fairly straightforward and are intended to test your capability of living and studying abroad. The visa questions you face will primarily interrogate your finances, the reason for choosing a particular course, your educational and professional background, your plans after the degree in the intended country, possibly your family background and your future goals. The result of your visa interview can either be Accepted/Approved. The Visa Officer will keep your passport with him/her and you can collect the stamped passport next day from the OFC Office or they can give you a visa rejection by issuing the Form 214b which is a general letter describing that you are a potential immigrant. In such an unfortunate event, don’t lose hope and don’t argue with the office. Accept the decision gracefully and move out of the consulate. Your actions post this might influence their decision during the next attempt of the interview."
    }


]